config.org
* General Settings
** Personal information

#+BEGIN_SRC elisp
(load-file "~/.config/doom/local.el")
(setq user-full-name "Nikolai Weidt")
(setq user-mail-address "aramus92@gmail.com")
#+END_SRC

** Fonts
Hack font
#+BEGIN_SRC elisp
(setq doom-font (font-spec :family "hack" :size 14))
#+END_SRC

** Line numbers
t, nil or 'relative
#+BEGIN_SRC elisp
(setq display-line-numbers-type 'relative)
#+END_SRC

** Theme

#+BEGIN_SRC elisp
(setq doom-theme 'doom-zenburn)
#+END_SRC

** Localization
German weekdays and months
#+BEGIN_SRC elisp
(setq calendar-week-start-day 1
          calendar-day-name-array ["Sonntag" "Montag" "Dienstag" "Mittwoch"
                                   "Donnerstag" "Freitag" "Samstag"]
          calendar-month-name-array ["Januar" "Februar" "März" "April" "Mai"
                                     "Juni" "Juli" "August" "September"
                                     "Oktober" "November" "Dezember"])
#+END_SRC

* Org

#+BEGIN_SRC elisp
(after! org
  (setq org-bullets-bullet-list '("✖" "✚")
        org-image-actual-width  300
        org-preview-latex-default-process 'dvisvgm
        org-latex-pdf-process (list "latexmk -shell-escape -bibtex -f -pdf %f")
        org-latex-prefer-user-labels t
        org-agenda-files '("~/org/" "~/org/roam/")
        org-ellipsis "▼")
  (setq org-latex-packages-alist
        '(("version=4" "mhchem")
          ("separate-uncertainty, exponent-product = \\cdot" "siunitx"))))
#+END_SRC

Class scrartcl for orgmode export:
#+BEGIN_SRC elisp :results none
(with-eval-after-load "ox-latex"
  (add-to-list 'org-latex-classes
               '("scrartcl" "\\documentclass[parskip]{scrartcl}"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))
#+END_SRC

org-ref
#+BEGIN_SRC elisp :results none
(use-package! org-ref
  :after org
;;  :init
 :config
 (setq reftex-default-bibliography '("~/Dropbox/bibliography/references.bib"))
 (setq org-ref-bibliography-notes "~/Dropbox/bibliography/notes.org"
       org-ref-default-bibliography '("~/Dropbox/bibliography/references.bib")
       org-ref-pdf-directory "~/Dropbox/bibliography/bibtex-pdfs/")

;; for helm-bibtex as completion method
 (setq bibtex-completion-bibliography "~/Dropbox/bibliography/references.bib"
      bibtex-completion-library-path "~/Dropbox/bibliography/bibtex-pdfs"
      bibtex-completion-notes-path "~/Dropbox/bibliography/helm-bibtex-notes")

;; open pdf with system pdf viewer (works on mac)
(setq bibtex-completion-pdf-open-function
  (lambda (fpath)
    (start-process "open" "*open*" "open" fpath)))
)
#+END_SRC

** Org-babel
#+BEGIN_SRC elisp
(setq org-babel-python-command "python3")
(after! org-babel
  (org-babel-jupyter-override-src-block "python"))

(setq org-babel-clojure-backend 'cider)
#+END_SRC

** Org-gcal
#+BEGIN_SRC elisp
(add-hook 'org-agenda-mode-hook (lambda () (org-gcal-sync) ))
(add-hook 'org-capture-after-finalize-hook (lambda () (org-gcal-sync) ))
#+END_SRC

** Org-capture
#+BEGIN_SRC elisp

#+END_SRC
** org-roam
#+BEGIN_SRC elisp
(after! org-roam
  (map! :leader
        :prefix "n"
        :desc "org-roam" "l" #'org-roam
        :desc "org-roam-insert" "i" #'org-roam-insert
        :desc "org-roam-switch-to-buffer" "b" #'org-roam-switch-to-buffer
        :desc "org-roam-find-file" "f" #'org-roam-find-file
        :desc "org-roam-show-graph" "g" #'org-roam-show-graph
        :desc "org-roam-insert-immediate" "I" #'org-roam-insert-immediate
        :desc "org-roam-capture" "c" #'org-roam-capture
        ;; :desc "org-journal-new-entry" "j" #'org-journal-new-entry))
        ))
;; deft for browsing notes
(setq deft-recursive t
      ;;       deft-use-filter-string-for-filename t
      ;;       deft-default-extension "org"
      deft-directory "~/org/roam/")
;; ;; org-journal for dailies
(setq org-journal-date-prefix "#+title: "
      org-journal-file-format "%Y-%m-%d.org"
      org-journal-dir "~/org/roam/"
      org-journal-time-format ""
      org-journal-date-format "%A, %d %B %Y")
(use-package! org-roam-bibtex
  :after org-roam
  :hook (org-roam-mode . org-roam-bibtex-mode))
(setq orb-preformat-keywords
      '("citekey" "title" "url" "author-or-editor" "keywords" "file")
      orb-process-file-field t
      orb-file-field-extensions "pdf")

(setq orb-templates
      '(("r" "ref" plain (function org-roam-capture--get-point)
         ""
         :file-name "${citekey}"
         :head "#+TITLE: ${citekey}: ${title}\n#+ROAM_KEY: ${ref}

- tags ::
- keywords :: ${keywords}

,* ${title}
:PROPERTIES:
:Custom_ID: ${citekey}
:URL: ${url}
:AUTHOR: ${author-or-editor}
:NOTER_DOCUMENT: ${file}
:NOTER_PAGE:
:END:")))
#+END_SRC

* Languages
** Arduino/Platformio
Add the required company backend
#+BEGIN_SRC elisp
(use-package! platformio-mode
:config (add-to-list 'company-backends 'company-irony)
)
#+END_SRC

Tell irony to use c++ in arduino mode
#+BEGIN_SRC elisp
(use-package! irony
:config
(add-to-list 'irony-supported-major-modes 'arduino-mode)
(add-to-list 'irony-lang-compile-option-alist '(arduino-mode . "c++")))
#+END_SRC

Enable irony for all c++ files, and platformio-mode only
when needed (platformio.ini present in project root).
#+BEGIN_SRC elisp
(add-hook! arduino-mode #'irony-mode 'irony-eldoc 'platformio-conditionally-enable)
#+END_SRC

Use irony's completion functions.
#+BEGIN_SRC elisp
(add-hook! irony-mode
  (define-key irony-mode-map [remap completion-at-point]
    'irony-completion-at-point-async)

  (define-key irony-mode-map [remap complete-symbol]
    'irony-completion-at-point-async)

  (irony-cdb-autosetup-compile-options))
#+END_SRC

Setup irony for flycheck.
#+BEGIN_SRC elisp
(add-hook! flycheck-mode 'flycheck-irony-setup)
#+END_SRC
** Python
#+BEGIN_SRC elisp
(after! python
  (defun python-shell-completion-native-try ()
    "Return non-nil if can trigger native completion."
    (let ((python-shell-completion-native-enable t)
          (python-shell-completion-native-output-timeout
           python-shell-completion-native-try-output-timeout))
      (python-shell-completion-native-get-completions
       (get-buffer-process (current-buffer))
       nil "_"))))
#+END_SRC
** Rust
** Go
** Scheme
#+begin_src elisp
(setq geiser-active-implementations '(chicken))
(setq geiser-chicken-binary "/usr/bin/chicken-csi")
#+end_src

* Mail
mu4e basic settings
#+BEGIN_SRC elisp
(set-email-account! "aramus92@gmail.com"
                    '(
                      (smtpmail-smtp-server . "smtp.gmail.com")
                      (smtpmail-smtp-user. "aramus92@gmail.com")
                      (smtpmail-smtp-service  . 587)
                      (smtpmail-stream-type   . starttls)
                      (smtpmail-debug-info    . t)
                      (mu4e-sent-folder . "/Gesendet")
                      (mu4e-drafts-folder . "/Entwürfe")
                      (mu4e-trash-folder . "/Papierkorb")
                      (mu4e-refile-folder . "/Alle")
                      (mu4e-compose-signature . "\nBest Regards\n\nNikolai Weidt")
                      (mu4e-update-interval . 60) ;; sec
                      )
                    t)
(setq smtpmail-auth-credentials (expand-file-name "~/.emacs.d/mu4e/.mbsyncpass-gmail.gpg"))
#+END_SRC

shortcuts:
#+BEGIN_SRC elisp
(after! mu4e
  (setq mu4e-maildir-shortcuts
        '( (:maildir "/INBOX"              :key ?i)
           (:maildir "/Gesendet"  :key ?s)
           (:maildir "/Papierkorb"      :key ?t)
           (:maildir "/Alle"   :key ?a)))
  (when (fboundp 'imagemagick-register-types)
    (imagemagick-register-types))
  (mu4e-alert-set-default-style 'libnotify)
  (mu4e-alert-enable-notifications)
  (add-to-list 'mu4e-bookmarks
               '(:name "Test"
                 :query "flag:unread AND maildir:/INBOX"
                 :key ?b))
  (setq mu4e-alert-interesting-mail-query
        (concat
         "flag:unread"
         " AND maildir:/INBOX"))
  )
#+END_SRC

* Helm-Bibtex
#+begin_src elisp
(use-package! helm-bibtex
  :config
  (setq bibtex-completion-pdf-field "File")
  (setq bibtex-completion-pdf-open-function 'find-file))
#+end_src

* Testing Stuff
#+BEGIN_SRC elisp
#+END_SRC
